Revit 2026 API

# FamilyFamilyCategory Property

---

Retrieves or sets a Category object that represents the category or sub category in which the elements ( this family could generate ) reside.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Category FamilyCategory { get; set; }
```
```vb
Public Property FamilyCategory As Category
	Get
	Set
```
```cpp
public:
property Category^ FamilyCategory {
	Category^ get ();
	void set (Category^ value);
}
```
```fsharp
member FamilyCategory : Category with get, set
```

#### Property Value

Category

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the input category cannot be assigned to this family. |
| ArgumentNullException | Thrown when the input category is . |

All category objects can be retrieved from the application by using the Categories property of the Application.Settings object.

#### Reference

Family Class

Autodesk.Revit.DB Namespace